run/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
        //type            symmetry;
    }

    outlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
        //type            symmetry;
    }

    top
    {
        type            fixedValue;
        //p0              uniform 0;
        value           uniform 0;
    }
    
    back
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    front
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }


}

// ************************************************************************* //
