run/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.slurry 0
    volScalarFieldValue alpha.debris 0
);

regions
(

    boxToCell
    {
        box (115 -178 670) (301 -131 730);//

        fieldValues
        (
            volScalarFieldValue alpha.air  0
            volScalarFieldValue alpha.slurry  0.82
            volScalarFieldValue alpha.debris  0.18
        );
    }
);

// ************************************************************************* //
